{ 
  "home" : {
    "about": {
      "title": "Nico Chen's Portfolio",
      "subtitle": "Full Stack Developer"
    },
    "header" : {
      "intro": "Hi, I'm ",
      "connect_email": "CONNECT WITH ME"
    },
    "work" : {
      "name": "Projects",
      "explore_button" : "Explore"
    },
    "skill" : {
      "name": "Skills"
    },
    "about_me" : {
      "name": "About Me"
    },
    "contact" : {
      "name": "Contact"
    }
  },

  "navMenu": {
    "work": "Projects",
    "about": "About",
    "contact": "Contact"
  },

  "personalInfo": {
    "headerTagline" : {
      "tag_1" : "Full Stack",
        "tag_2" : "Web Developer",
        "tag_3" : "Innovation is my passion"
    },
    "project" : {
      "title_1" : "Luniu Mall APP",
      "para_1": "Luniu Mall is a local E-commerce Platform in Vancouver. Independently complete the back-end construction and development of this project. Using Restful API to interact with front-end. Main technology: PHP + Lumen + Mysql",

      "title_2" : "Luniu Mall Delivery System (Dashboard + APP)",
      "para_2": "The delivery system is mainly used for managing drivers and tracking location. It increases user experience.  Mainly doing back-end development, Main technology: NodeJs + Express + GraphQL + Mysql",

      "title_3" : "YiPinChuXing Uber",
      "para_3": "YiPinChuXing Uber is a local online car-hailing platform in Vancouver, with multiple platforms: passenger terminal, driver App, and background management. Main back-end technology: Golang + Gin + GraphQL + PostgreSQL. Main front-end technology: Vue.js + Apollo + GraphQL",

      "title_4" : "Shikr Delivery",
      "para_4": "Shikr Delivery is a small shop which including customer site, driver App. Mainly doing the back-end development. Main technology: PHP + CakePhp",

      "title_5" : "PHP Composer Package: AlphaPay Payment Integration",
      "para_5": "PHP composer Package. Integrate Wechat Pay and Alipay through Alpha Pay Payment Gateway APIs. Allow Canadian merchants to easily accept Wechat Pay and Alipay for their E-commerce Platform. Main technology: PHP",

      "title_6" : "Wechat MiniProgram - Online Shop",
      "para_6": "It is Sass E-commerce platform. Fulfill multiple requirements/Adding new features. Main technology: PHP + Yii2"

    },
    "about" : {
      "aboutParaOne" : "I am Nico Chen, I graduated from Simon Fraser University in Canada in September 2017, majoring in computer science. I have a passion for programming! I have a sense of accomplishment after solving a problem every time! I like this feeling, so I can indulge into world of code!",
      "aboutParaTwo" : "Proficient in processing back-end development/database connection/hosting construction. Being a team leadier, I lead front-end and back-end developers to collaborate on new projects. This experience has improved my coordination capabilities and teamwork spirit which allow me to face any difficulties and challenges",
      "aboutParaThree" : "My hobbies are fishing/skiing/playing badminton, etc., These exercises bring me a sense of pleasure, relieve tension, and reduce the pressure of work"
    },
    "skill" : {
      "para_1" : "PHP is back-end programming language, Proficient in developing MVC Framework (Lumen/Laravel/Yii2) RestFul API. ",
      "para_2" : "JS can be used to write both front and back end. Generally developing back-end by using Node. Proficient in developing Express framework and Sequelize ORM to connect database.",
      "para_3" : "Golang is back-end programming language, Proficient in developing Gin Framework",
      "para_4" : "MySQL is a relational database. Proficient in using SQL Query to obtain the desired data. Understand Primary Key and Foreign Key, etc.",
      "para_5" : "GraphQL is the query language of the API, which can be used to obtain data.",
      "para_6" : "Interactions needed when the front and back ends are separated, reasonably plan the URL style and return results, and manage the API version update."
    }
  }


}